/**
 * @fileoverview Шар репозиторію для даних користувачів у системі "Електронна черга".
 *
 * @description
 * Цей модуль надає методи доступу до даних користувачів. Наразі використовується in-memory сховище як заглушка,
 * що імітує базу даних із масивом об’єктів користувачів та методом для отримання користувача за ID.
 *
 * Властивості користувача:
 * - id: Унікальний ідентифікатор.
 * - name: Ім’я користувача.
 *
 * Містить тестові дані для демонстрації. Розроблено для заміни реальною базою даних у майбутньому.
 *
 * @module repositories/userRepository
 *
 * @author [Ваше Ім’я]
 * @date 2025-02-27
 */

let users = [
  { id: 1, name: "Owner1" },
  { id: 2, name: "User1" },
  { id: 3, name: "User2" },
];

/**
 * Отримує користувача за його ID.
 * @param {number} id - Ідентифікатор користувача.
 * @returns {Object|null} Об’єкт користувача, якщо знайдено, інакше null.
 */
export const getUserById = (id) => users.find((u) => u.id === id);
